Revit 2016 API
Application.NewLoadCaseArray Method
Creates a new instance of a LoadCase array.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
Syntax
C#
public LoadCaseArray NewLoadCaseArray()
Visual Basic
Public Function NewLoadCaseArray As LoadCaseArray
Visual C++
public:
LoadCaseArray^ NewLoadCaseArray()
See Also
Application Class
Autodesk.Revit.Creation Namespace